In [181]:
import pandas as pd

In [144]:
#Question1:
#Answer:
data = {"A": [1,2,3,4] , "B": [5,6,7,3] , "C": [9,10,11,12]}
df = pd.DataFrame(data)

In [145]:
df

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  3  12

In [146]:
pd.Series(df['A'])

0    1
1    2
2    3
3    4
Name: A, dtype: int64

In [147]:
df.reset_index()

   index  A  B   C
0      0  1  5   9
1      1  2  6  10
2      2  3  7  11
3      3  4  3  12

In [148]:
df.fillna("msg")

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  3  12

In [149]:
df.drop('A' , axis = 1)

   B   C
0  5   9
1  6  10
2  7  11
3  3  12

In [151]:
#Question2:
#Answer:
df1 = pd.DataFrame({'A':[1,2,3,4], 
                    'B':[5,6,7,8],
                    'C':[8,9,10,11]})

In [152]:
df1

   A  B   C
0  1  5   8
1  2  6   9
2  3  7  10
3  4  8  11

In [33]:
def reindex_func(df):
    df.index = pd.RangeIndex(start = 1 ,stop = len(df)*2, step = 2)
    return df

In [35]:
df1 = reindex_func(df1)

In [36]:
df1

   A  B   C
1  1  5   8
3  2  6   9
5  4  8  11
7  3  7  10

In [14]:
#Question3:
#Answer:
df2 = pd.DataFrame({"Values":[10,20,30,40,50]})

In [15]:
df2

   Values
0      10
1      20
2      30
3      40
4      50

In [16]:
df_sum = df2['Values'][0:3]

In [17]:
 df_sum

0    10
1    20
2    30
Name: Values, dtype: int64

In [18]:
def add(df):
    sum = 0
    for i in df_sum:
        sum = sum+i
    print("sum of the first three value,",sum)

In [19]:
add(df2)

sum of the first three value, 60

In [21]:
#or

In [20]:
def addition(df):
    sum1 = 0
    for i,j in df.iterrows():
        value = j["Values"]
        sum1 = sum1+value
        if i == 2:
            break
    print("Sum of the first three values:",sum1)

In [76]:
addition(df2)

Sum of the first three values: 60

In [49]:
#Question6:
#Answer:
pd.set_option("display.max_colwidth",1000)
df3 = pd.DataFrame({"Text":["You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console." , "my name is saurabh kumar kushwaha" , "i am doing the assignment of 24th feb"]})

In [50]:
df3

                                                                                                                                                                                                                                               Text
0  You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
1                                                                                                                                                                                                                 my name is saurabh kumar kushwaha
2                                                                                                                                                                                                             i am doing the assignment of 24th feb

In [52]:
def word(x):
    return len(x.split())

In [51]:
df3["World_Count"] = df3["Text"].apply(word)

In [53]:
df3

,Text,World_Count
0,You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.,42
1,my name is saurabh kumar kushwaha,6
2,i am doing the assignment of 24th feb,8

In [58]:
#Question5:
#Answer:
df3.size #it returns total number of element inside the dataframe

6

In [57]:
df3.shape #returns a tuple representing the dimensions of the DataFrame.

(3, 2)

In [ ]:
#Question6:
#Answer:
#function of pandas do we use to read an excel file.
pd.read_excel("filename.xlsx")

In [59]:
#Question7:
#Answer:
df4 = pd.DataFrame({"Email":["aman@gmail.com","saurabh@gmail.com","abc@gmail.com","cdf@gmail.com"]})

In [60]:
df4

               Email
0     aman@gmail.com
1  saurabh@gmail.com
2      abc@gmail.com
3      cdf@gmail.com

In [71]:
def user(df):
    df4["Username"] =  df4['Email'].str.split("@").str[0]
    return df

In [73]:
df4 = df4.apply(user)

In [74]:
df4

               Email Username
0     aman@gmail.com     aman
1  saurabh@gmail.com  saurabh
2      abc@gmail.com      abc
3      cdf@gmail.com      cdf

In [93]:
#Question8:
#Answer:
data = {"A":[3,8,6,2,9],
        "B":[5,2,9,3,1],
        "C":[1,7,4,5,7]}

In [94]:
df5 = pd.DataFrame(data)

In [95]:
df5

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  7

In [96]:
def filter(df):
    selected_row = df[(df['A'] > 5)&(df['B']<10)]
    df6 = pd.DataFrame(selected_row)
    return df6

In [97]:
filter(df5)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  7

In [98]:
#Question9:
#Answer:
df7 = pd.DataFrame({"Values":[10,20,30,40,50]})

In [99]:
df7

   Values
0      10
1      20
2      30
3      40
4      50

In [100]:
df7.mean()

Values    30.0
dtype: float64

In [101]:
df7.median()

Values    30.0
dtype: float64

In [102]:
df7.std()

Values    15.811388
dtype: float64

In [132]:
#Question10:
#Answer:
date = pd.date_range(start = "2023-07-01" , end = "2023-07-07")

In [133]:
date

DatetimeIndex(['2023-07-01', '2023-07-02', '2023-07-03', '2023-07-04',
               '2023-07-05', '2023-07-06', '2023-07-07'],
              dtype='datetime64[ns]', freq='D')

In [134]:
sales = []

In [135]:
for i in range(7):
    sales.append(i*100)

In [136]:
sales

[0, 100, 200, 300, 400, 500, 600]

In [137]:
df8 = pd.DataFrame({"Sales": sales , "Date": date})

In [138]:
df8

   Sales       Date
0      0 2023-07-01
1    100 2023-07-02
2    200 2023-07-03
3    300 2023-07-04
4    400 2023-07-05
5    500 2023-07-06
6    600 2023-07-07

In [139]:
def average(df):
    df["MovingAverage"] = df['Sales'].rolling(window = 7 ,min_periods=1).mean()
    return df

In [141]:
df8 = average(df8)

In [142]:
df8

   Sales       Date  MovingAverage
0      0 2023-07-01            0.0
1    100 2023-07-02           50.0
2    200 2023-07-03          100.0
3    300 2023-07-04          150.0
4    400 2023-07-05          200.0
5    500 2023-07-06          250.0
6    600 2023-07-07          300.0

In [184]:
#Question11:
#Answer:
date1 = pd.date_range(start = "2023-01-01" , end = "2023-01-05")
date1

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05'],
              dtype='datetime64[ns]', freq='D')

In [185]:
df9 = pd.DataFrame({"Date":date1})

In [186]:
df9

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [193]:
def week(df):
    df['Weekday'] = df['Date'].dt.day_name()
    
    return df

In [194]:
week(df9)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [197]:
#Question12:
#Answer:
date2 = pd.date_range(start = "2023-01-01" ,end = "2023-01-31")

In [198]:
df10 = pd.DataFrame({"Date":date2})

In [199]:
df10

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

In [203]:
def rows(df):
    start_date = pd.to_datetime("2023-01-01")
    end_date = pd.to_datetime("2023-01-31")
    selected_rows = df[(df["Date"]> start_date)&(df["Date"] < end_date)]
    return selected_rows

In [204]:
rows(df10)

         Date
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30

In [196]:
#Question13:
#Answer:

#To use the basic functions of Pandas, the first and foremost necessary library that needs to be imported is pandas itself.
import pandas as pd